app/controllers/hellos_controller.rb

    def set_hello
      @hello = Hello.find(params[:id])
---
SELECT `hellos`.* FROM `hellos` WHERE `hellos`.`id` = NULL LIMIT 1